-- Наполнение таблиц тестовыми данными
INSERT INTO ingredient (name, current_quantity, min_quantity)
VALUES
    ('Сахар', 1000, 50),
    ('Вода', 5000, 200),
    ('Кофе', 1000, 200),
    ('Молоко', 2000, 200),
    ('Какао', 1000, 50);

INSERT INTO coffee_recipe (name, description)
VALUES
    ('Эспрессо', 'Классический крепкий кофе'),
    ('Капучино', 'Эспрессо с молочной пеной'),
    ('Латте', 'Эспрессо с молоком'),
    ('Горячий шоколад', 'Какао с молоком и сахаром'),
    ('Американо', 'Эспрессо с добавлением горячей воды');

INSERT INTO recipe_ingredient (recipe_id, ingredient_id, amount)
VALUES
    (1, 3, 10),
    (2, 3, 10),
    (2, 4, 100),
    (3, 3, 10),
    (3, 4, 150),
    (4, 1, 20),
    (4, 2, 200),
    (4, 5, 30),
    (5, 2, 150),
    (5, 3, 10);

INSERT INTO users (username, email)
VALUES
    ('Демьян', 'ddd@ya.ru'),
    ('Алиса', 'aaa@ya.ru'),
    ('Ювиналий', 'uuu@ya.ru');

INSERT INTO usage_log (user_id, recipe_id, status, amount, created_at)
VALUES
    (1, 1, 'успешно', 0, '2024-06-01 10:00:00'),
    (2, 2, 'успешно', 1, '2024-06-01 11:30:00'),
    (3, 3, 'успешно', 2, '2024-06-02 09:45:00'),
    (1, 4, 'успешно', 0, '2024-06-02 14:20:00'),
    (3, 1, 'успешно', 1, '2024-06-03 18:30:00'),
    (1, 2, 'успешно', 0, '2024-06-04 13:55:00'),
    (2, 3, 'успешно', 2, '2024-06-04 15:00:00'),
    (3, 4, 'успешно', 0, '2024-06-05 11:25:00');

INSERT INTO error_log (user_id, error_message, created_at)
VALUES
    (1, 'Нехватка молока', '2024-05-01 10:05:00'),
    (2, 'Нехватка сахара', '2024-05-03 16:15:00');
